consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp.c
/*
*********************************************************************************************************
*                                            EXAMPLE CODE
*
*               This file is provided as an example on how to use Micrium products.
*
*               Please feel free to use any application code labeled as 'EXAMPLE CODE' in
*               your application products.  Example code may be used as is, in whole or in
*               part, or may be used as a reference only. This file can be modified as
*               required to meet the end-product requirements.
*
*               Please help us continue to provide the Embedded community with the finest
*               software available.  Your honesty is greatly appreciated.
*
*               You can find our product's user manual, API reference, release notes and
*               more information at https://doc.micrium.com.
*               You can contact us at www.micrium.com.
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*
*                                    MICRIUM BOARD SUPPORT PACKAGE
*
*                                     ST Microelectronics STM32
*                                              on the
*
*                                         STM3240G-EVAL
*                                        Evaluation Board
*
* Filename      : bsp.c
* Version       : V1.00
* Programmer(s) : FF
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                             INCLUDE FILES
*********************************************************************************************************
*/

#define   BSP_MODULE
#include  <bsp.h>
#include  <bsp_os.h>

#include  <stm32f4xx_hal.h>


/*
*********************************************************************************************************
*                                            LOCAL DEFINES
*********************************************************************************************************
*/

#define  BSP_BIT_RCC_PLLCFGR_PLLM               25u
//#define  BSP_BIT_RCC_PLLCFGR_PLLM               8u
#define  BSP_BIT_RCC_PLLCFGR_PLLN              336u
#define  BSP_BIT_RCC_PLLCFGR_PLLP                2u
#define  BSP_BIT_RCC_PLLCFGR_PLLQ                7u


#define  BSP_GPIOD_LED4                        DEF_BIT_12
#define  BSP_GPIOD_LED3                        DEF_BIT_13
#define  BSP_GPIOD_LED5                        DEF_BIT_14
#define  BSP_GPIOD_LED6                        DEF_BIT_15

#define  BSP_GPIOC_SEGMENTA                     DEF_BIT_13
#define  BSP_GPIOC_SEGMENTB                     DEF_BIT_09
#define  BSP_GPIOE_SEGMENTC                     DEF_BIT_07
#define  BSP_GPIOA_SEGMENTD                     DEF_BIT_05
#define  BSP_GPIOA_SEGMENTE                     DEF_BIT_01
#define  BSP_GPIOD_SEGMENTF                     DEF_BIT_06
#define  BSP_GPIOE_SEGMENTG                     DEF_BIT_13
#define  BSP_GPIOC_SEGMENTH                     DEF_BIT_05
#define  BSP_GPIOC_SEGCOM1                      DEF_BIT_15
#define  BSP_GPIOD_SEGCOM2                      DEF_BIT_04
#define  BSP_GPIOD_SEGCOM3                      DEF_BIT_02
#define  BSP_GPIOE_SEGCOM4                      DEF_BIT_15

#define  BSP_GPIOD_K0                           DEF_BIT_00
#define  BSP_GPIOD_K1                           DEF_BIT_01
#define  BSP_GPIOD_K2                           DEF_BIT_02
#define  BSP_GPIOD_K3                           DEF_BIT_03
#define  BSP_GPIOB_K4                           DEF_BIT_04
#define  BSP_GPIOB_K5                           DEF_BIT_05
#define  BSP_GPIOB_K6                           DEF_BIT_07
#define  BSP_GPIOB_K7                           DEF_BIT_08

#define  BSP_GPIOD_KEYMASK                      0x0F
// BSP_GPIOD_K0 | BSP_GPIOD_K1 | BSP_GPIOD_K2 | BSP_GPIOD_K3

#define BSP_GPIOE_LED_ROW1                      DEF_BIT_07 // PE07
#define BSP_GPIOE_LED_ROW2                      DEF_BIT_08 // PE08
#define BSP_GPIOE_LED_ROW3                      DEF_BIT_09 // PE09
#define BSP_GPIOE_LED_ROW4                      DEF_BIT_10 // PE10
#define BSP_GPIOE_LED_ROW5                      DEF_BIT_11 // PE11
#define BSP_GPIOE_LED_ROW6                      DEF_BIT_12 // PE12
#define BSP_GPIOE_LED_ROW7                      DEF_BIT_13 // PE13
#define BSP_GPIOE_LED_ROW8                      DEF_BIT_14 // PE14

#define BSP_GPIOB_LED_COL1                      DEF_BIT_12 // PB12
#define BSP_GPIOB_LED_COL2                      DEF_BIT_13 // PB13
#define BSP_GPIOB_LED_COL3                      DEF_BIT_14 // PB14
#define BSP_GPIOB_LED_COL4                      DEF_BIT_15 // PB15
#define BSP_GPIOD_LED_COL5                      DEF_BIT_08 // PD08
#define BSP_GPIOD_LED_COL6                      DEF_BIT_09 // PD09
#define BSP_GPIOD_LED_COL7                      DEF_BIT_10 // PD10
#define BSP_GPIOD_LED_COL8                      DEF_BIT_11 // PD11

/*
*********************************************************************************************************
*                                           LOCAL CONSTANTS
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                          LOCAL DATA TYPES
*********************************************************************************************************
*/


/*
*********************************************************************************************************
*                                            LOCAL TABLES
*********************************************************************************************************
*/


