consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp.c
/*
*********************************************************************************************************
*                                              BSP_LED_Off()
*
* Description : Turn OFF any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    turns OFF ALL the LEDs
*                       3    turns OFF user LED3
*                       4    turns OFF user LED4
*                       5    turns OFF user LED5
*                       6    turns OFF user LED6
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_LED_Off (CPU_INT08U led)
{
    switch (led) {
        case 0u:
             HAL_GPIO_WritePin(GPIOD, (BSP_GPIOD_LED3 | BSP_GPIOD_LED4 | BSP_GPIOD_LED5 | BSP_GPIOD_LED6 ), GPIO_PIN_RESET);
             break;


        case 3u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED3, GPIO_PIN_RESET);
             break;


        case 4u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED4, GPIO_PIN_RESET);
             break;


        case 5u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED5, GPIO_PIN_RESET);
             break;


        case 6u:
             HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_LED6, GPIO_PIN_RESET);
             break;


        default:
             break;
    }
}


/*
*********************************************************************************************************
*                                            BSP_LED_Toggle()
*
* Description : TOGGLE any or all the LEDs on the board.
*
* Argument(s) : led     The ID of the LED to control:
*
*                       0    TOGGLE ALL the LEDs
*                       3    TOGGLE user LED3
*                       4    TOGGLE user LED4
*                       5    TOGGLE user LED5
*                       6    TOGGLE user LED6
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_LED_Toggle (CPU_INT08U  led)
{
    switch (led) {
        case 0u:
             HAL_GPIO_TogglePin(GPIOD,(BSP_GPIOD_LED3 | BSP_GPIOD_LED4 | BSP_GPIOD_LED5 | BSP_GPIOD_LED6));
             break;


        case 3u:
             HAL_GPIO_TogglePin(GPIOD,BSP_GPIOD_LED3);
             break;


        case 4u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED4);
             break;


        case 5u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED5);
             break;


        case 6u:
             HAL_GPIO_TogglePin(GPIOD, BSP_GPIOD_LED6);
             break;


        default:
             break;
    }
}

/*
*********************************************************************************************************
*                                           BSP_ButtonInit()
*
* Description : Initialize the STM32F4DISCOVERY's user button
*
* Argument(s) : none
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

static void  BSP_ButtonInit()
{
    GPIO_InitTypeDef gpio_init;
      
    BSP_PeriphEn(BSP_PERIPH_ID_GPIOA);
    gpio_init.Pin = GPIO_PIN_0;
    gpio_init.Mode = GPIO_MODE_IT_RISING;
    gpio_init.Pull  = GPIO_PULLDOWN;
    
    HAL_GPIO_Init(GPIOA, &gpio_init);

}  

/*
*********************************************************************************************************
*                                           BSP_ButtonClearIT()
*
* Description : Clear Interrupt Pending due to the STM32F4DISCOVERY's user button
*
* Argument(s) : none
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_ButtonClearIT()
{
   __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_0);
}  

/*
*********************************************************************************************************
*                                           BSP_SEGMENT_Init()
*
* Description : Initialize any or all the SEVEN SEGMENT LEDs Installed.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : 
  SEGMENTA    GPIOC_13
  SEGMENTB    GPIOC_9
  SEGMENTC    GPIOE_7
  SEGMENTD    GPIOA_5
  SEGMENTE    GPIOA_1
  SEGMENTF    GPIOD_6
  SEGMENTG    GPIOE_13
  SEGMENTH    GPIOC_5
  SEGCOM1     GPIOC_15
  SEGCOM2     GPIOD_4
  SEGCOM3     GPIOD_2
  SEGCOM4     GPIOE_15
*********************************************************************************************************
*/
static void BSP_SEGMENT_Init()
{
  GPIO_InitTypeDef      gpio_init;
  
  gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
  gpio_init.Pull = GPIO_PULLUP;
  gpio_init.Speed = GPIO_SPEED_HIGH;
  
  // Configure GPIOA
  BSP_PeriphEn(BSP_PERIPH_ID_GPIOA);
  gpio_init.Pin = BSP_GPIOA_SEGMENTD | BSP_GPIOA_SEGMENTE;
  HAL_GPIO_Init(GPIOA, &gpio_init);
  
  // Configure GPIOC
  BSP_PeriphEn(BSP_PERIPH_ID_GPIOC);
  gpio_init.Pin = BSP_GPIOC_SEGMENTA | BSP_GPIOC_SEGMENTB | BSP_GPIOC_SEGMENTH | BSP_GPIOC_SEGCOM1;
  HAL_GPIO_Init(GPIOC, &gpio_init);
  
  // Configure GPIOD
  BSP_PeriphEn(BSP_PERIPH_ID_GPIOD);
  gpio_init.Pin = BSP_GPIOD_SEGMENTF | BSP_GPIOD_SEGCOM2 | BSP_GPIOD_SEGCOM3;
  HAL_GPIO_Init(GPIOD, &gpio_init);
  
  // Configure GPIOE
  BSP_PeriphEn(BSP_PERIPH_ID_GPIOE);
  gpio_init.Pin = BSP_GPIOE_SEGMENTC | BSP_GPIOE_SEGMENTG | BSP_GPIOE_SEGCOM4;
  HAL_GPIO_Init(GPIOE, &gpio_init);
}

/*
*********************************************************************************************************
*                                             BSP_SEGMET_On()
*
* Description : Turn ON any or all the LEDS in the SEGMENT specified by com
*
* Argument(s) : com     The Digit ID from 1 to 4 (left to right)
*               seg     Controls segment LEDS
*                       bit 7 - SEGMENTA, bit 6 - SEGMENTB, bit 5 - SEGMENTC, bit 4 - SEGMENTD
*                       bit 3 - SEGMENTE, bit 2 - SEGMENTF, bit 1 - SEGMENTG, bit 0 - SEGMENTH(DP
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_SEGMENT_On (CPU_INT08U  com, CPU_INT08U   seg)
{

