consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp.c
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);       
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);        
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);        
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);   
  
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);  
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);
  
  
  if (seg & 0x80)   HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_SET);
  if (seg & 0x40)   HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_SET);  
  if (seg & 0x20)   HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_SET);
  if (seg & 0x10)   HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_SET);
  if (seg & 0x08)   HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_SET);
  if (seg & 0x04)   HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_SET);
  if (seg & 0x02)   HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_SET);
  if (seg & 0x01)   HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_SET);
  
  switch (com) {
      case 1:
        HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_RESET);
        break;
      case 2:   
        HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_RESET);        
        break;
      case 3:   
        HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_RESET);        
        break;
      case 4:
        HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_RESET);
        break;
      default:
        break;
  }
}

/*
*********************************************************************************************************
*                                             BSP_SEGMET_Off()
*
* Description : Turn OFF All LEDs in the segment display
*
* Argument(s) : none.
* 
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void  BSP_SEGMENT_Off ()
{

  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGCOM1, GPIO_PIN_SET);       
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM2, GPIO_PIN_SET);        
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGCOM3, GPIO_PIN_SET);        
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGCOM4, GPIO_PIN_SET);   
  
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTA, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTB, GPIO_PIN_RESET);  
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTC, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTD, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOA, BSP_GPIOA_SEGMENTE, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOD, BSP_GPIOD_SEGMENTF, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOE, BSP_GPIOE_SEGMENTG, GPIO_PIN_RESET);
  HAL_GPIO_WritePin(GPIOC, BSP_GPIOC_SEGMENTH, GPIO_PIN_RESET);

}

/*
*********************************************************************************************************
* Modified part
*********************************************************************************************************
*/

/*
*********************************************************************************************************
*                                           BSP_KeyMat_Init()
*
* Description : Initialize Key matrix gpio.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : 
  K0  GPIOD_0
  K1  GPIOD_1
  K2  GPIOD_2
  K3  GPIOD_3
  K4  GPIOB_4
  K5  GPIOB_5
  K6  GPIOB_6
  K7  GPIOB_7
*********************************************************************************************************
*/

static void BSP_KeyMat_Init(void)
{
     GPIO_InitTypeDef      gpio_init;

     // Configure GPIOD output

     gpio_init.Pin = BSP_GPIOD_K0 | BSP_GPIOD_K1 | BSP_GPIOD_K2 | BSP_GPIOD_K3;
     gpio_init.Mode = GPIO_MODE_INPUT;
     gpio_init.Pull = GPIO_PULLDOWN;
     gpio_init.Speed = GPIO_SPEED_MEDIUM;

     BSP_PeriphEn(BSP_PERIPH_ID_GPIOD);
     HAL_GPIO_Init(GPIOD, &gpio_init);

     // Configure GPIOB input

     gpio_init.Pin = BSP_GPIOB_K4 | BSP_GPIOB_K5 | BSP_GPIOB_K6 | BSP_GPIOB_K7;
     gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
     gpio_init.Pull = GPIO_NOPULL;
     gpio_init.Speed = GPIO_SPEED_MEDIUM;

     BSP_PeriphEn(BSP_PERIPH_ID_GPIOB);
     HAL_GPIO_Init(GPIOB, &gpio_init);
}

/*
*********************************************************************************************************
*                                             BSP_SEGMET_On()
*
* Description : Turn ON any or all the LEDS in the SEGMENT specified by com
*
* Argument(s) : none.
*
* Return(s)   : Key matrix status, x bit set means button x is pressed
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

CPU_INT16U BSP_KeyMat_read(void)
{
     CPU_INT16U key_state = 0;
     uint8_t i;
     
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K5 |BSP_GPIOB_K6 |BSP_GPIOB_K7, GPIO_PIN_RESET);
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K4, GPIO_PIN_SET);
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K0) ? 1 : 0) << 0;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K1) ? 1 : 0) << 1;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K2) ? 1 : 0) << 2;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K3) ? 1 : 0) << 3;
     
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K4 |BSP_GPIOB_K6 |BSP_GPIOB_K7, GPIO_PIN_RESET);
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K5, GPIO_PIN_SET);
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K0) ? 1 : 0) << 4;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K1) ? 1 : 0) << 5;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K2) ? 1 : 0) << 6;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K3) ? 1 : 0) << 7;
     
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K4 |BSP_GPIOB_K5 |BSP_GPIOB_K7, GPIO_PIN_RESET);
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K6, GPIO_PIN_SET);
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K0) ? 1 : 0) << 8;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K1) ? 1 : 0) << 9;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K2) ? 1 : 0) << 10;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K3) ? 1 : 0) << 11;
     
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K4 |BSP_GPIOB_K5 |BSP_GPIOB_K6, GPIO_PIN_RESET);
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K7, GPIO_PIN_SET);
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K0) ? 1 : 0) << 12;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K1) ? 1 : 0) << 13;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K2) ? 1 : 0) << 14;
     key_state |= (HAL_GPIO_ReadPin(GPIOD, BSP_GPIOD_K3) ? 1 : 0) << 15;

