consilium538/Sogang-Univ-MicroProcesser2-2019/Examples/ST/STM3240G-EVAL/BSP/bsp.c
     HAL_GPIO_WritePin(GPIOB, BSP_GPIOB_K4 |BSP_GPIOB_K5 |BSP_GPIOB_K6 |BSP_GPIOB_K7, GPIO_PIN_RESET);

     return key_state;
}


/*
*********************************************************************************************************
*                                           BSP_DotMat_Init()
*
* Description : Initialize Dot matrix gpio.
*
* Argument(s) : none.
*
* Return(s)   : none.
*
* Caller(s)   : Application.
*
* Note(s)     : 
LED_ROW1 PE07
LED_ROW2 PE08
LED_ROW3 PE09
LED_ROW4 PE10
LED_ROW5 PE11
LED_ROW6 PE12
LED_ROW7 PE13
LED_ROW8 PE14

LED_COL1 PB12
LED_COL2 PB13
LED_COL3 PB14
LED_COL4 PB15
LED_COL5 PD08
LED_COL6 PD09
LED_COL7 PD10
LED_COL8 PD11
*********************************************************************************************************
*/

static void BSP_DotMat_Init(void)
{
     GPIO_InitTypeDef      gpio_init;

     // Row initialize, Pull-up& Pull-down
     // Configure GPIOE output

     gpio_init.Pin = BSP_GPIOE_LED_ROW1 | BSP_GPIOE_LED_ROW2 | \
                     BSP_GPIOE_LED_ROW3 | BSP_GPIOE_LED_ROW4 | \
                     BSP_GPIOE_LED_ROW5 | BSP_GPIOE_LED_ROW6 | \
                     BSP_GPIOE_LED_ROW7 | BSP_GPIOE_LED_ROW8;
     gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
     gpio_init.Pull = GPIO_PULLUP;
     gpio_init.Speed = GPIO_SPEED_HIGH;

     BSP_PeriphEn(BSP_PERIPH_ID_GPIOE);
     HAL_GPIO_Init(GPIOE, &gpio_init);

     // Column initialize, Open drain
     // Configure GPIOB input

     gpio_init.Pin = BSP_GPIOB_LED_COL1 | BSP_GPIOB_LED_COL2 | \
                     BSP_GPIOB_LED_COL3 | BSP_GPIOB_LED_COL4;
     gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
     gpio_init.Pull = GPIO_NOPULL;
     gpio_init.Speed = GPIO_SPEED_HIGH;

     BSP_PeriphEn(BSP_PERIPH_ID_GPIOB);
     HAL_GPIO_Init(GPIOB, &gpio_init);

     // Configure GPIOD input

     gpio_init.Pin = BSP_GPIOD_LED_COL5 | BSP_GPIOD_LED_COL6 | \
                     BSP_GPIOD_LED_COL7 | BSP_GPIOD_LED_COL8;
     gpio_init.Mode = GPIO_MODE_OUTPUT_PP;
     gpio_init.Pull = GPIO_NOPULL;
     gpio_init.Speed = GPIO_SPEED_HIGH;

     BSP_PeriphEn(BSP_PERIPH_ID_GPIOD);
     HAL_GPIO_Init(GPIOD, &gpio_init);
}

/*
*********************************************************************************************************
*                                             BSP_SEGMET_On()
*
* Description : Turn ON any or all the LEDS in the SEGMENT specified by com
*
* Argument(s) : none.
*
* Return(s)   : Key matrix status, x bit set means button x is pressed
*
* Caller(s)   : Application.
*
* Note(s)     : none.
*********************************************************************************************************
*/

void BSP_DotMat_write(CPU_INT08U rowdata, CPU_INT08U colnum)
{
     GPIOB->BSRR = (BSP_GPIOB_LED_COL1 | BSP_GPIOB_LED_COL2 | \
                     BSP_GPIOB_LED_COL3 | BSP_GPIOB_LED_COL4);
     GPIOD->BSRR = (BSP_GPIOD_LED_COL5 | BSP_GPIOD_LED_COL6 | \
                     BSP_GPIOD_LED_COL7 | BSP_GPIOD_LED_COL8);
     switch(colnum)
     {
          case 7:
               GPIOB->BSRR = BSP_GPIOB_LED_COL1 << 16;
               break;
          case 6:
               GPIOB->BSRR = BSP_GPIOB_LED_COL2 << 16;
               break;
          case 5:
               GPIOB->BSRR = BSP_GPIOB_LED_COL3 << 16;
               break;
          case 4:
               GPIOB->BSRR = BSP_GPIOB_LED_COL4 << 16;
               break;
          case 3:
               GPIOD->BSRR = BSP_GPIOD_LED_COL5 << 16;
               break;
          case 2:
               GPIOD->BSRR = BSP_GPIOD_LED_COL6 << 16;
               break;
          case 1:
               GPIOD->BSRR = BSP_GPIOD_LED_COL7 << 16;
               break;
          case 0:
               GPIOD->BSRR = BSP_GPIOD_LED_COL8 << 16;
               break;
          default:
               break;
     }
     GPIOE->BSRR = rowdata << 7 | ~rowdata << (7 + 16);
     return;
}
